lagrangian/reactingParcelFoam/splashPanel/0.orig/wallFilmRegion/Uf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/wallFilmRegion";
    object      Uf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallFilmFaces_top
    {
        type            slip;
    }

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            noSlip;
    }

    side1
    {
        type            noSlip;
    }

    side2
    {
        type            noSlip;
    }

    side3
    {
        type            noSlip;
    }

    side4
    {
        type            noSlip;
    }
}


// ************************************************************************* //
